---
kind: method
id: M:Autodesk.Revit.DB.TextNote.GetLeaders
zh: 注释、文字注释
source: html/be3005ca-94ae-cfd6-3990-db01308dfa96.htm
---
# Autodesk.Revit.DB.TextNote.GetLeaders Method

**中文**: 注释、文字注释

Returns a collection of leaders currently attached to the text note.

## Syntax (C#)
```csharp
public IList<Leader> GetLeaders()
```

## Remarks
This method supersedes an older Leaders property which has been deprecated.